let a = 42
let b = a
b++
console.log('a', a) // 42
console.log('b', b) // 43

//=================================================================

let a = [1, 2, 3]
let b = a // заносим в переменную ссылку на массив, изменяются оба массива
b.push(4)
console.log('a', a) // [1, 2, 3, 4]
console.log('b', b) // [1, 2, 3, 4]

//=================================================================

let a = [1, 2, 3]
let b = a.concat() //b-изолированная, вернулась копия массива
b.push(4)
console.log('a', a) // [1, 2, 3]
console.log('b', b) // [1, 2, 3, 4]

//=================================================================

let a = [1, 2, 3]
let b = a 
b.push(4)

let c = [1, 2, 3, 4]

console.log('a', a)
console.log('b', b)

console.log(a === b) // один и тот же массив
console.log(a === c) // разные массивы
